{
    "fnol_data": {
        "claim_number": "Unique identifier assigned to the insurance claim. Eg. C9CB6205",
        "policy_number": "Unique number linked to the insurance policy under which the claim is filed. Eg. PC171779360",
        "date_of_loss": "Date when the incident or loss occurred. Eg. 2025-04-01.",
        "time_of_loss": "Time when the incident or loss took place. Eg. 04:03:07.",
        "loss_location": "Address or location where the loss or damage happened. Eg. 37802 Andre Shoals Suite 964 South Amanda, KY 89536",
        "loss_location_state" : "State of location where the loss or damage happened. eg. Arizona",
        "loss_location_zipcode" : "Zipcode of location where the loss or damage happened. Eg. 51818",
        "date_of_reporting_loss": "The Date on which the claim was reported. Eg. 2025-04-01.",
        "loss_cause" : "Brief description of why the loss occured. It can on have the following values - {Animal Collision, Collision with fixed object, Collision with motor vehicle, Natural Calamity, Malicious mischief and vandalism, Theft of entire vehicle, Theft Audio or other parts, Glass breakage} ",
        "claimant_name": "Name of the person filing the claim. Eg. George Norman",
        "vehicle_make": "Manufacturer of the insured vehicle. Eg. Honda",
        "vehicle_model": "Model of the insured vehicle. Eg. F-150",
        "vehicle_year": "Year of manufacture of the insured vehicle. Eg. 2006",
        "damage_description": "Details about the nature and extent of the damage. It can only have these values {Front-end damage, Side collision, Minor scratches, Rear-end damage, Total loss}",
        "reported_by": "Name of the individual who reported the claim (could be the policyholder or another party). Eg. Courtney Richardson",
        "claim_status": "Current state of the claim. It can only have these values : {Under Investigation, Open, Closed, Pending).",
        "claim_assigned": "Indicates whether the claim is assigned to a person to handle it or not. It can only have these values : {1, 0}.",
        "claim_handler_name" : "Name of the person handling this claim. Eg. Maria Hernandez",
        "litigation" : "Indicates whether there was litigation involved. It can only have these values : {1, 0}.",
        "police_report": "Indicates whether a police report was filed. It can only have these values : {1, 0}.",
        "photos_videos": "Evidence of the damage in the form of images or video files. It can only have these values : {1, 0}.",
        "repair_estimate_presence": "Indicates the presence of an Estimated cost of repairs provided by an auto shop or adjuster. It can only have these values : {1, 0}.",
        "repair_estimate" : "Estimated monetary cost of vehicle repair bill. It can have a float amount or blank value if it doesnt exist. Eg. 4529",
        "repair_bill" : "Monetary amount that is the actual cost of vehicle repair incurred. It can have a float amount or blank value if it doesnt exist. Eg. 4529",
        "towing_receipt": "Receipt for towing services incurred due to the incident. It can only have these values : {1, 0}.",
        "rental_receipt": "Receipt for rental vehicle expenses covered under the policy. It can only have these values : {1, 0}.",
        "medical_and_injury_documentation": "Documents related to medical expenses and injury claims. It can only have these values : {1, 0}.",
        "medical_reports": "Short reports from healthcare providers regarding injuries, N/A if unavailable. Eg. Whiplash",
        "hospital_records": "Records from hospitals or clinics that specify medical treatment type if any. It can have values like {ER visit, N/A, Surgery required, Overnight observation, Outpatient consultation, Physiotherapy}",
        "medical_bill" : "Monetary amount of medical bill. It can have a float amount or blank value if it doesnt exist. Eg. 4250",
        "total_claim_bill" : "Monetary amount of total cost incurred in this claim. It can have a float amount or blank value if it doesnt exist. Eg. 4250",
        "third_party_information": "Details about any third party involved in the claim. It can only have these values : {1, 0}.",
        "subro_opportunity " : "Indicates whether the claim has a possibility of subrogation. It can only have these values : {1, 0}.",
        "third_party_insurance": "Insurance details of the third party involved in the incident. It can have third party insurance provider name or N/A if that is unavailable. Eg. Conner-Coleman",
        "third_party_claim_form": "Claim form submitted by or against a third party. It can only have these values : {1, 0}.",
        "damage_severity" : "Severity of Vehicle Damage. It can only have the values {LOW, MEDIUM, HIGH, N/A}",
        "injury_severity" : "Severity of Injury Damage. It can only have the values {LOW, MEDIUM, HIGH, N/A}"
    },
    "policy_data": {
        "policy_number": "Unique number assigned to the insurance policy. Eg. PC171779360",
        "account_number": "Account number attached to the insurance policy. Eg. AC91332642",
        "expiration_date": "Date at which the insurance policy expires. Eg. 2025-02-02",
        "effective_date": "Date at which the insurance policy's cover starts. Eg. 2024-08-06",
        "policy_status": "The status of the policy issuance to the user. It can only have the values : {Bound, Issued, Cancelled}",
        "policy_term" : "The time within which the policy is effective. Eg. 12 months",
        "product_line": "Type of policy. It can only have the values : {Auto}",
        "primary_insured_name": "The full legal name of the main person or entity covered under the insurance policy. Eg. George Norman",
        "policy_holder_age": "The age of the policy holder. Eg. 46",
        "primary_insured_address": "The full address of the main person or entity covered under the insurance policy. Eg. Unit 8480 Box 1845, DPO AE 38970",
        "primary_insured_location_zipcode" :"The zipcode of the main person or entity covered under the insurance policy. Eg. 38970",
        "primary_insured_location_state": "The resident state of the main person or entity covered under the insurance policy. Eg. Arizona",
        "premium_amount": "The monetary payment made by the insured to an insurance provider to keep the policy active and maintain coverage. Eg. 1483.87",
        "underwriter_name": "The name of the person or entity responsible for assessing and approving the insurance policy. Eg. Angie Henderson",
        "agent_name" : "The insurance representative who sold or managed the policy on behalf of the insurance company. Eg. Zachary Hicks",
        "payment_plan" : "The agreed schedule or method by which the insured pays their insurance premium. It can only have the values : {Annual, Monthly, Quarterly, Semi-Annual}",
        "risk_type": "The category or nature of risk being insured against. It can only have the values : {Vehicle}",
        "vehicle_vin": "The unique 17-character code that identifies a specific vehicle. Eg. 1HGCM82633A010310",
        "property_address": "The physical location of the insured property covered under the insurance policy. Eg. Unit 8480 Box 1845, DPO AE 38970",
        "cancellation_date": "The date on which an insurance policy is officially terminated and coverage ends when the policy is Cancelled. It can only have empty value or a date Eg. 2024-05-18",
        "reason_for_cancellation" : "the explanation or cause for terminating an insurance policy. It can only have empty value or the values : {Customer Request, Underwriting Decision, Non-payment, Fraud}"
    }
}